<details ><summary>apply for ruby-getting-started-terraform 2026-01-02 13:41:33 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_role_policy.lambda will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda" {
        id     = "ruby-getting-started-lambda-role:ruby-getting-started-lambda-policy"
        name   = "ruby-getting-started-lambda-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "iam:PassRole",
                            "rds:StartExportTask",
                            "rds:DescribeDBSnapshots",
                            "rds:DescribeDBInstances",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:GenerateDataKey",
                          - "kms:DescribeKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ap-northeast-1:786832920677:key/bc7dadbf-feb7-4625-bc41-5a0c4fad9756"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.scheduler will be updated in-place
  ~ resource "aws_iam_role_policy" "scheduler" {
        id     = "ruby-getting-started-scheduler-role:ruby-getting-started-scheduler-policy"
        name   = "ruby-getting-started-scheduler-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "ec2:StopInstances",
                            "rds:StopDBInstance",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ap-northeast-1:786832920677:function:rds_s3_export"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "rds_s3_export"
      + id                  = (known after apply)
      + principal           = "scheduler.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # aws_scheduler_schedule.rds_export will be created
  + resource "aws_scheduler_schedule" "rds_export" {
      + arn                          = (known after apply)
      + description                  = "Daily RDS snapshot export to S3 at 23:00 JST"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "ruby-getting-started-rds-export-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 14 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:lambda:ap-northeast-1:786832920677:function:rds_s3_export"
          + input    = jsonencode({})
          + role_arn = "arn:aws:iam::786832920677:role/ruby-getting-started-scheduler-role"
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
aws_iam_role_policy.lambda: Modifying... [id=ruby-getting-started-lambda-role:ruby-getting-started-lambda-policy]
aws_iam_role_policy.scheduler: Modifying... [id=ruby-getting-started-scheduler-role:ruby-getting-started-scheduler-policy]
aws_scheduler_schedule.rds_export: Creating...
aws_iam_role_policy.lambda: Modifications complete after 0s [id=ruby-getting-started-lambda-role:ruby-getting-started-lambda-policy]
aws_iam_role_policy.scheduler: Modifications complete after 0s [id=ruby-getting-started-scheduler-role:ruby-getting-started-scheduler-policy]
aws_scheduler_schedule.rds_export: Creation complete after 1s [id=default/ruby-getting-started-rds-export-schedule]
aws_lambda_permission.allow_eventbridge: Creating...
aws_lambda_permission.allow_eventbridge: Creation complete after 0s [id=AllowExecutionFromEventBridge]

Apply complete! Resources: 2 added, 2 changed, 0 destroyed.

Outputs:

bastion_instance_id = "i-096998226f432cbc4"
connection_instructions = <<EOT
# 1. Connect to Bastion via SSM
aws ssm start-session --target i-096998226f432cbc4

# 2. RDS connection information
Database: ruby_getting_started
Endpoint: ruby-getting-started-mysql.ctz6dn0wk1gw.ap-northeast-1.rds.amazonaws.com
Port: 3306
Username: admin

# Retrieve password:
aws secretsmanager get-secret-value --secret-id arn:aws:secretsmanager:ap-northeast-1:786832920677:secret:ruby-getting-started-rds-password-xKcpWw --query SecretString --output text | jq -r .password

# Note: MySQL client installation requires NAT Gateway or public subnet access since the bastion is in a private subnet.

EOT
rds_database_name = "ruby_getting_started"
rds_endpoint = "ruby-getting-started-mysql.ctz6dn0wk1gw.ap-northeast-1.rds.amazonaws.com:3306"
rds_password_secret_arn = "arn:aws:secretsmanager:ap-northeast-1:786832920677:secret:ruby-getting-started-rds-password-xKcpWw"

```
</details>
</details>